{
  "personalDetails": {
    "name": "Abhishek Mukund Kumbhar",
    "tagLine": "Turning complex requirements into scalable, end-to-end web applications."
  },
  "socialLinks": {
    "linkedin": "https://www.linkedin.com/in/abhishek-mukund-kumbhar-343776201",
    "github": "https://github.com/AbhishekMukundKumbhar",
    "instagram": "https://www.instagram.com/kumbar_abhi_1919/",
    "facebook": "https://www.facebook.com/profile.php?id=100008871036864&mibextid=ZbWKwL"
  },
  "profileSteps": [
    "Senior Software Developer",
    1000,
    "Frontend Developer",
    1000,
    "Micro Frontend Developer",
    1000,
    "Full Stack Developer",
    1000,
    "Node.js Developer",
    1000
  ],
  "summary": "Senior Software Developer with 5 years of experience building scalable web applications using React.js, TypeScript, JavaScript, HTML, CSS, SCSS, and Redux. Strong expertise in Micro Frontend architecture, Webpack 5, and frontend performance optimization. Experienced in Node.js, Express.js, RESTful APIs, TypeORM, and testing with Jest and Mocha-Chai. Focused on clean, maintainable code and high-quality user experiences.",
  "skills": [
    "HTML",
    "CSS",
    "JAVASCRIPT",
    "REACT.JS",
    "TYPESCRIPT",
    "REDUX",
    "BOOTSTRAP",
    "NODE.JS",
    "EXPRESS.JS",
    "WEBPACK 5",
    "MICRO FRONTENDS",
    "SCSS",
    "TYPEORM",
    "AWS S3",
    "JEST",
    "MOCHA-CHAI",
    "JAVA",
    "ORACLE DB",
    "GIT"
  ],
  "experience": [
    {
      "companyName": "Deloitte",
      "role": "Senior Software Developer",
      "startDate": "05/2023",
      "endDate": "Present",
      "location": "Bangalore, India",
      "keyResponsibilities": [
        "Led the decomposition of a monolithic frontend into a scalable Micro Frontend architecture, creating independent applications for the core shell and individual business modules.",
        "Owned the initial setup and independent deployment strategy for micro frontends by collaborating closely with the DevOps team, enabling isolated builds, CI/CD pipelines, and faster release cycles.",
        "Implemented React Module Federation using Webpack 5 to support dynamic module loading, shared dependencies, and seamless runtime integration across micro frontends.",
        "Designed and governed state management architecture, maintaining a common global store for shared state while enabling independent local stores for individual micro frontends, mentored team members on best practices.",
        "Developed multiple reusable components for use across different projects as per the organisation standards.",
        "Developed RESTful APIs using Node.js and Express.js, defined data models and entities with TypeORM, and integrated APIs with React-based frontend applications.",
        "Implemented file upload and storage solutions using AWS S3, and supported API hosting and deployments on AWS.",
        "Collaborated with cross-functional teams (backend, QA, product, DevOps) to ensure seamless integration, scalability, and operational stability of applications.",
        "Built reusable, standards-compliant UI components to improve consistency, reusability, and development efficiency across projects.",
        "Developed custom data visualizations using ECharts, implementing advanced chart configurations to meet complex business requirements."
      ]
    },
    {
      "companyName": "HCL Technologies",
      "role": "Software Engineer - Junior Developer",
      "startDate": "01/2021",
      "endDate": "05/2023",
      "location": "Bangalore, India",
      "keyResponsibilities": [
        "Developed and maintained frontend components using React.js, following best practices for component reusability, state management, and UI consistency.",
        "Wrote and executed unit test cases for Node.js application using Mocha and Chai, ensuring code reliability and improving test coverage.",
        "Analysed application logs and defect reports to identify root causes of issues raised through JIRA, collaborating with senior developers when required.",
        "Debugged and resolved application issues by performing root cause analysis, code fixes, and validation, contributing to improved application stability and reduced defect recurrence."
      ]
    }
  ],
  "personalProjects": [
    {
      "name": "AMK mart",
      "gitLink": "https://github.com/AbhishekMukundKumbhar/react_shopping_clone/tree/master/shopping_clone_react",
      "img": "AMKMart",
      "previewLink": "https://drive.google.com/file/d/1sE0gGspjSx2JAbKlzFwMPMFTQFAOR9M2/view?usp=drivesdk",
      "desc": "Developed \"AMK mart\" a ecommerce shopping application that includes the functionalities like home page UI to view all products, view product details, add to cart, UI for cart, increase and decrease quantity of product in cart, total price and billing with respect quantity of products, remove product from cart."
    },
    {
      "name": "Post Now !",
      "gitLink": "https://github.com/AbhishekMukundKumbhar/Full-stack-social-media-app/tree/master/Full_stack_social_media_app",
      "img": "postNow",
      "previewLink": "https://drive.google.com/file/d/1s4KJoK4HLdllMMxHFB17Qe45AFgdtX3q/view?usp=drivesdk",
      "desc": "Developed \"Post now!\" a social media application that includes all the real time requirements like posting post, like - unlike and commenting on post, follow - unfollow of users, user profile, searching profile and so on."
    }
  ]
}
